IDEA Open Model
HangingAroundPatch Properties
Compatible with IDEA StatiCa 20.1
The HangingAroundPatch type exposes the following members.
Properties
Name | Description
BottomPartLength
 Length of bottom part
Diameter
 Diameter o reinforcement
DiameterOfMandrel
 Diameter of mandrel - multiplier of bar diameter to obtain inner diameter of bent reinforcement bars
DistanceFromPatch
 Distance from patch support/load
EndsType
 End type of the reinforcement bar - same for both ends
Id
 Element Id
 (Inherited from OpenElementId.)
InclinedPartsAngle
 Inclination of inclined parts
InclinedPartsLength
 Length of inclined parts
IsMirrored
 Add same reinforcement on oposide side (rotated 180°)
LegsLength
 Length of legs
MasterComponent
 Master component of hanging
Material
 Material
 (Inherited from Reinforcement.)
NumOfBarsInLayer
 Number of bars in layer
ReinfId
 Id representing reinforcement in Detail
 (Inherited from Reinforcement.)
Rotation
 Angle of reinforcement rotation around patch point
Top
See Also
Reference
HangingAroundPatch Class
IdeaRS.OpenModel.Detail Namespace